## Daniel Jurkowski grupa 5
### Ćwiczenie 3
Łączenie z bazą danych i instrukcja select

In [36]:
import pandas as pd
from sqlalchemy import create_engine

db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"
db = create_engine(db_string)
connection = db.connect()

##### 1. Ile kategorii filmów mamy w wypożyczalni?

In [37]:
dataframe = pd.read_sql('select count(category_id) from category', con=connection)
dataframe

   count
0     16

##### 2. Wyświetl listę kategorii w kolejności alfabetycznej.

In [38]:
dataframe = pd.read_sql('select distinct name from category order by name asc', con=connection)
dataframe

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

##### 3. Znajdź najstarszy i najmłodszy film do wypożyczenia.

In [62]:
# W bazie są tylko same filmy z 2006 roku

dataframe = pd.read_sql('select distinct title, release_year from film where release_year = (select max(release_year) from film) or '
                        'release_year = (select min(release_year) from film) limit 1', con=connection)
dataframe

              title  release_year
0  Academy Dinosaur          2006

##### 4. Ile wypożyczeń odbyło się między 2005-07-01 a 2005-08-01?

In [46]:
dataframe = pd.read_sql("select count(rental_date) from rental where rental_date between '2005-07-01 00:00:00' and '2005-08-01 23:59:59'", con=connection)
dataframe

   count
0   7380

##### 5. Ile wypożyczeń odbyło się między 2010-01-01 a 2011-02-01?

In [47]:
dataframe = pd.read_sql("select count(rental_date) from rental where rental_date between '2010-01-01 00:00:00' and '2010-02-01 23:59:59'", con=connection)
dataframe

   count
0      0

#####  6. Znajdź największą płatność wypożyczenia.

In [61]:
dataframe = pd.read_sql("select distinct * from payment where amount = (select max(amount) from payment) limit 1", con=connection)
dataframe

,payment_id,customer_id,staff_id,rental_id,amount,payment_date
0,20403,362,1,14759,11.99,2007-03-21 21:57:24.996577

##### 7. Znajdź wszystkich klientów z Polski, Nigerii lub Bangladeszu.

In [59]:
# W poniższych zadaniach zostały wykorzystane "views" czyli wirtualne tabele utworzone z zapytania SQL.

dataframe = pd.read_sql("select distinct id, name from customer_list where country in ('Poland', 'Nigeria', 'Bangladesh')", con=connection)
dataframe

     id              name
0    18      Carol Garcia
1    21    Michelle Clark
2    80      Marilyn Ross
3   103   Gladys Hamilton
4   128   Marjorie Tucker
5   156   Bertha Ferguson
6   198      Elsie Kelley
7   232    Constance Reid
8   250         Jo Fowler
9   270       Leah Curtis
10  277      Olga Jimenez
11  280    Tracey Barrett
12  284     Sonia Gregory
13  286       Velma Lucas
14  318       Brian Wyman
15  329    Frank Waggoner
16  332    Stephen Qualls
17  380   Russell Brinson
18  409    Rodney Moeller
19  501       Ruben Geary
20  558  Jimmie Eggleston
21  562     Wallace Slone
22  571  Johnnie Chisholm
23  572   Sidney Burleson

##### 8. Gdzie mieszkają członkowie personelu?

In [60]:
dataframe = pd.read_sql("select distinct address, city, country from staff_list", con=connection)
dataframe

                address        city    country
0  1411 Lillydale Drive   Woodridge  Australia
1     23 Workhaven Lane  Lethbridge     Canada

##### 9. Ilu pracowników mieszka w Argentynie lub Hiszpanii?

In [63]:
dataframe = pd.read_sql("select count(*) from staff_list where country in ('Argentina', 'Spain')", con=connection)
dataframe

   count
0      0

##### 10. Jakie kategorie filmów zostały wypożyczone przez klientów?

In [77]:
dataframe = pd.read_sql("select distinct category from sales_by_film_category where total_sales >= 1", con=connection)
dataframe

       category
0        Sports
1        Sci-Fi
2     Animation
3         Drama
4        Comedy
5           New
6        Action
7       Foreign
8         Games
9        Family
10  Documentary
11       Horror
12     Classics
13     Children
14       Travel
15        Music

##### 11. Znajdź wszystkie kategorie filmów wypożyczonych w Ameryce.

In [69]:
dataframe = pd.read_sql("select distinct category from film_list where fid in (select film_id from inventory "
                        "where inventory_id in (select inventory_id from rental where customer_id"
                        " in (select id from customer_list where country = 'United States')))", con=connection)
dataframe

       category
0        Sports
1      Classics
2           New
3        Family
4        Comedy
5     Animation
6        Travel
7         Music
8         Drama
9        Horror
10       Sci-Fi
11        Games
12  Documentary
13      Foreign
14       Action
15     Children

##### 12. Znajdź wszystkie tytuły filmów, w których grał: Olympia Pfeiffer lub Julia Zellweger, lub Ellen Presley.

In [75]:
dataframe = pd.read_sql("select title from film_list where actors like '%%Ellen Presley%%' or actors "
                        "like '%%Olympia Pfeiffer%%' or actors like '%%Julia Zellweger%%'", con=connection)
dataframe

                   title
0            Badman Dawn
1        Bilko Anonymous
2   Breakfast Goldfinger
3      Caribbean Liberty
4       Casper Dragonfly
..                   ...
64             Turn Star
65            Wait Cider
66          Women Dorado
67             Won Dares
68         Wyoming Storm

[69 rows x 1 columns]